import "../style.css"

import React, { useState } from "react"

import { useRouterPanel } from "@kokateam/router-vkminiapps"
import { PanelHeader } from "@vkontakte/vkui"
import { Button } from "../components/Button"

import { itemsInfo } from "../vendor/gameInfo"

const MainPage = () => {
    const [_, toPanel] = useRouterPanel()
    const [activeCategory, setActiveCategory] = useState("Все")

    return <main className="bg-red-200">
        <PanelHeader separator={true}>
            <span className="flex justify-center text-md text-[#FF4800]">Игры</span>
        </PanelHeader>

        <div className="flex justify-between fixed bg-white gap-4 w-full px-4 py-6">
            <Button isFulled onClick={() => toPanel("rating")}>
                <svg width="14" height="15" viewBox="0 0 14 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.99134 2.03571C3.69417 2.03571 3.23237 2.12489 2.75767 2.37876C2.37563 2.58308 2.08306 2.87565 1.87875 3.25768C1.62487 3.73238 1.5357 4.19419 1.5357 5.49136V9.50864C1.5357 10.8058 1.62487 11.2676 1.87875 11.7423C2.08306 12.1243 2.37563 12.4169 2.75767 12.6212C3.23237 12.8751 3.69417 12.9643 4.99134 12.9643H9.00862C10.3058 12.9643 10.7676 12.8751 11.2423 12.6212C11.6243 12.4169 11.9169 12.1243 12.1212 11.7423C12.3751 11.2676 12.4643 10.8058 12.4643 9.50864V5.49136C12.4643 4.19419 12.3751 3.73238 12.1212 3.25768C11.9169 2.87565 11.6243 2.58308 11.2423 2.37876C10.7676 2.12489 10.3058 2.03571 9.00862 2.03571H4.99134ZM4.99134 0.821426H9.00862C10.6325 0.821426 11.2213 0.990502 11.815 1.30799C12.4086 1.62548 12.8745 2.09138 13.192 2.68503C13.5095 3.27868 13.6786 3.86752 13.6786 5.49136V9.50864C13.6786 11.1325 13.5095 11.7213 13.192 12.315C12.8745 12.9086 12.4086 13.3745 11.815 13.692C11.2213 14.0095 10.6325 14.1786 9.00862 14.1786H4.99134C3.36751 14.1786 2.77866 14.0095 2.18501 13.692C1.59136 13.3745 1.12546 12.9086 0.807974 12.315C0.490486 11.7213 0.321411 11.1325 0.321411 9.50864V5.49136C0.321411 3.86752 0.490486 3.27868 0.807974 2.68503C1.12546 2.09138 1.59136 1.62548 2.18501 1.30799C2.77866 0.990502 3.36751 0.821426 4.99134 0.821426ZM5.17855 10.5357C5.17855 10.871 4.90673 11.1429 4.57141 11.1429C4.2361 11.1429 3.96427 10.871 3.96427 10.5357V6.89286C3.96427 6.55754 4.2361 6.28571 4.57141 6.28571C4.90673 6.28571 5.17855 6.55754 5.17855 6.89286V10.5357ZM7.60713 10.5357C7.60713 10.871 7.3353 11.1429 6.99998 11.1429C6.66467 11.1429 6.39284 10.871 6.39284 10.5357V4.46428C6.39284 4.12897 6.66467 3.85714 6.99998 3.85714C7.3353 3.85714 7.60713 4.12897 7.60713 4.46428V10.5357ZM10.0357 10.5357C10.0357 10.871 9.76387 11.1429 9.42855 11.1429C9.09324 11.1429 8.82141 10.871 8.82141 10.5357V8.10714C8.82141 7.77182 9.09324 7.5 9.42855 7.5C9.76387 7.5 10.0357 7.77182 10.0357 8.10714V10.5357Z" fill="white" />
                </svg>
                <span>Рейтинг</span>
            </Button>

            <Button isFulled onClick={() => toPanel("about")}>
                <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.00001 0.214279C12.0238 0.214279 15.2857 3.4762 15.2857 7.49999C15.2857 11.5238 12.0238 14.7857 8.00001 14.7857C3.97622 14.7857 0.714294 11.5238 0.714294 7.49999C0.714294 3.4762 3.97622 0.214279 8.00001 0.214279ZM8.00001 1.42856C4.64685 1.42856 1.92858 4.14684 1.92858 7.49999C1.92858 10.8532 4.64685 13.5714 8.00001 13.5714C11.3532 13.5714 14.0714 10.8532 14.0714 7.49999C14.0714 4.14684 11.3532 1.42856 8.00001 1.42856ZM8.04471 6.28571C8.18896 6.28571 8.27952 6.30825 8.35867 6.35058C8.43782 6.39291 8.49994 6.45503 8.54228 6.53419C8.58461 6.61334 8.60715 6.7039 8.60715 6.84815V10.5804C8.60715 10.7247 8.58461 10.8152 8.54228 10.8944C8.49994 10.9735 8.43782 11.0356 8.35867 11.078C8.27952 11.1203 8.18896 11.1429 8.04471 11.1429H7.95531C7.81105 11.1429 7.7205 11.1203 7.64135 11.078C7.56219 11.0356 7.50007 10.9735 7.45774 10.8944C7.41541 10.8152 7.39287 10.7247 7.39287 10.5804V6.84815C7.39287 6.7039 7.41541 6.61334 7.45774 6.53419C7.50007 6.45503 7.56219 6.39291 7.64135 6.35058C7.7205 6.30825 7.81105 6.28571 7.95531 6.28571H8.04471ZM8.00001 3.61428C8.46945 3.61428 8.85001 3.99484 8.85001 4.46428C8.85001 4.93372 8.46945 5.31428 8.00001 5.31428C7.53057 5.31428 7.15001 4.93372 7.15001 4.46428C7.15001 3.99484 7.53057 3.61428 8.00001 3.61428Z" fill="white" />
                </svg>
                <span>О приложении</span>
            </Button>
        </div>

        <section className="min-h-screen space-y-4 mt-22 p-2">
            <div className="flex shrink-0 flex-nowrap space-x-2 overflow-x-auto w-full">
                {itemsInfo.categoryes.map((item, index) => (
                    <Button
                        onClick={() => setActiveCategory(item)}
                        className={`border ${activeCategory === item ? "border-[#430B51] bg-[#430B51] text-white" : "border-white bg-gray-300 text-[#430B51]"} font-semibold rounded-full whitespace-nowrap px-3 py-1`} key={index}
                    >
                        {item}
                    </Button>
                ))}
            </div>

            {itemsInfo.data.map((category, itemIndex) => (
                <div key={itemIndex}>
                    {
                        (activeCategory === "Все" || activeCategory === category.title) &&
                        <div>
                            {
                                activeCategory === "Все" &&
                                <h1 className="font-bold text-[#430B51]">{category.title}</h1>
                            }
                            {category.games.map((game, indexGame) => (
                                <div className="bg-white rounded-md space-y-3 text-sm p-2 m-2" key={indexGame}>
                                    <h1 className="font-bold text-[#FF4800]">{game.title}</h1>
                                    <p>{game.description}</p>
                                    <Button onClick={() => toPanel(game.code)}>Играть</Button>
                                </div>
                            ))}
                        </div>
                    }
                </div>
            ))}
        </section>
    </main>
}

export default MainPage