export const itemsInfo = {
    categoryes: ["Все", "На внимание"],
    data: [
        // {
        //     title: "Словесные",          categoryes "Словесные",
        //     games: [
        //         {
        //             title: "Продолжи слово",
        //             description: `Игроки по очереди добавляют слова, начиная с последней буквы предыдущего слова. Например: "Кот", "Тигр", "Рыба".`,
        //             code: "continue-word"
        //         },
        //         {
        //             title: "Категории",
        //             description: `Бот предлагает категорию, и игроки должны назвать что-то из этой категории на каждую букву алфавита. Например, категория "Фрукты": А - ананас, Б - банан, В - вишня.`,
        //             code: "categoryes"
        //         }
        //     ]
        // },
        {
            title: "На внимание",
            games: [
                {
                    title: "Анаграмы",
                    description: "Разгадай слово из хаоса букв! Чем длиннее слово — тем выше награда. Используй подсказки, участвуй в турнирах и стань королём анаграмм!",
                    code: "anagrams"
                },
                {
                    title: "Мемори",
                    description: "Игрокам показывается набор карточек, которые затем переворачиваются. Задача - запомнить расположение и найти пары одинаковых карточек.",
                    code: "memory"
                }
            ]
        },
    ]
}
